# 编写人 : 陈昌志
# 开发时间 : 2022/7/24 17:00

#---------------------------------------------------
#变量由三部分组成：标识=id211411313，类型=str，值=‘马里亚’
name = '马里亚'
print(name)
print('标识',id(name))
print('类型',type(name))
print('值',name)

#有两个空间，一个是储存name，name里面是id，id对应的另外一个空间是储存类型id和值的，类似java
name = '1'
name = '2'
#多次赋值后，会产生垃圾空间

#------------------------------------------------------------------------------
#常见数据类型4个 int(十进制默认，二进制以0b开头，八进制以0o开头，十六进制以0x开头) float bool str
print(5.3,type(5.3))
print(2.2+1.1)#浮点数的加减不准确  3.3000000000000003

#解决方法：导入decimal模块

from decimal import Decimal
print(Decimal('1.1')+Decimal('2.2')) #3.3

print(True+1)#python中的bool可以转化为整数
print(False-1)

# ’‘ “” “”“”“” 三引号可以分在多行表示
str1 = """12

12"""

str2 = '''121

13'''

print(str1)
print(str2)

#----------------------------------
#类型转换 int() str() float()
#str()  和 ’‘效果一样
#文字类和小数类字符串无法变为int
#文字类无法变为整数，整数变为浮点数，末尾为.0 float
name = '11'
age = 20
#print('我叫'+name+'今年'+age+'岁')这是错误的，int不可以和str进行连接
print('我叫'+name+'今年'+str(age)+'岁')
#str1 = '1.1'   int(str) 报错，因为字符串为小数
'''我是多行注释'''